// task03, Релационните бази данни съхраняват данни в „таблици“, където всеки ред представлява обект,
//докато колоните представляват свойствата / полетата в обекта. Всички обекти в таблица са от един и 
//същи тип / схема, т.е.всички имат едни и същи полета. Разбира се, всеки ред обикновено има различни
//стойности във всяко от своите полета, но понякога някои редове имат еднакви стойности в някои от колоните
//(например в таблица с хора, с име на колони, възраст и височина, двама души могат да имат същата възраст 
//или една и съща височина, дори едно и също име). Една често срещана операция с таблици в бази данни е 
//преброяване на сходства между обектите.Например можете да търсите най - често срещаната стойност в колона.

